//=====================================================
#include <avr/wdt.h>
#include <SPI.h>
#include <Ethernet.h>
//=====================================================
void setup() {
  //------------------------------------------
  Serial.begin(115200);
  while (!Serial){
    ;
  };
  Serial.println("AVW5_Start......");
  //------------------------------------------
  Time_Setup(); 
  DHT_Setup();  
  LCD_Setup();
  AVW_Setup();
  //------------------------------------------
  AVW_Loop(false);//首次读取超时很多
  //------------------------------------------
  Serial.println("WatchDog_Start......");
  //开启看门狗，并设置溢出时间为8秒
  wdt_enable(WDTO_8S);  
  //------------------------------------------
  wdt_reset();
  Ethernet_Setup();
  wdt_reset();
  //------------------------------------------
  LeWei_Setup();
  //------------------------------------------
  Serial.println("Start_Loop......"); 
  //------------------------------------------
}
void loop() {
  //------------------------------------------
  //Serial.println("Start_Loop"); 
  wdt_reset();
  //喂狗操作，使看门狗定时器复位
  //------------------------------------------
  Time_Loop(true);
  DHT_Loop(true);
  AVW_Loop(false);
  LCD_Loop(false);
  LeWei_Loop(true);  
  //------------------------------------------
}
