//===================================================================
#include "bIMU.h"
//===================================================================
#include "Timer.h"
Timer t;//时间类
float timeKey = 20; //滤波法采样时间间隔毫秒
//===================================================================
static const String codeName = "Mpu6050_Nano_WS201X_2";
//===================================================================
void setup() {
  //-------------------------------------
  Pin_setup();//必须首先执行，防止烧毁硬件
  //-------------------------------------
  lgsetup(codeName);
  MPU6050_setup();
  ss_init("BlueTooth", true, 's', 'e');
  //-------------------------------------
  int tickEvent1 = t.every(10, IMU_loop) ;
  int tickEvent2 = t.every(20, IMU_work) ;
  int tickEvent3 = t.every(1000, IMU_BlueTooth_Out) ;
  //-------------------------------------
}
void loop() {
  t.update();
}
//===================================================================
