//-------------------------------------
//12345678901234567890
//$MFF7F7F7F00FF*
//-------------------------------------
int cmd_ym = 0,cmd_


int cmd_roll = 0; //1滚转：机头尾连线轴运动 Roll
int cmd_pitch = 0; //2前后/俯仰：飞机、低头、抬头 Pitch
int cmd_power = 0; //3油门
int cmd_yaw = 0; //4左右/偏航：机首机尾左右旋转 Yaw
//-------------------------------------
int rc_cmd_len = 20;
char rc_cmd[rc_cmd_len];
int rc_idx = -1;
//-------------------------------------
void rc_cmd_loop(char c) {
  //-------------------------------------
  rc_idx++;
  rc_cmd[rc_idx] = c;
  //-------------------------------------
  if (c == '$') {
    rc_idx = -1;
  } else if (rc_idx == 2) {
    

  }
  //-------------------------------------
}

void rc_cmd_clear() {
  for (int i = 0; i < rc_cmd_len; i++) {
    rc_cmd[i] = '\0';
  }
}
