<?php
    //==============================================================================
	$use_name = $_GET['n'];  //ECHO $use_name.'<BR>';
	$use_pass = $_GET['p'];  //ECHO $use_pass.'<BR>';
	$use_gpss = $_GET['g'];  //ECHO $use_gpss.'<BR>';
    //==============================================================================
?>
<?php
    //==============================================================================
	include "bbk_php/congif.php";
	include "bbk_php/bbk_GetUrl_Magic.php";//去除URL系统对JSON数据添加的引号！
	include "bbk_php/bbk_GetIdByNamePass_V9LG.php";
	include "bbk_php/bbk_Save_GpsLog_V9LG2.php";
    //==============================================================================
?>
<?php //json_decode(all);
    //==============================================================================
	//http://www.bbkgps.com/v/s.php?n=boboking&p=123xjp&g=23,110,8848,80,270,12,1446048000000
	//==============================================================================
	@$use_idid = GetIdByNamePass_V9LG( $use_name, $use_pass ); // 帐户验证
	if( $use_idid <= -1){ DIE("User Name/Pass Error!"); }//else{ ECHO 'User Name/Pass OK!<BR>'; }
    //==============================================================================
	$gps_qry = Save_GpsLog_V9LG2( $use_idid, $use_gpss );
	//ECHO "gps_qry=".$gps_qry."<BR>";
    //==============================================================================
	if( $gps_qry==1 ){ DIE("UpYes"); }else{ DIE("UpERR"); }
    //==============================================================================
?>