/*
//===================================================================
1.两轮平衡小车
2.MEGA2560
3.Serial  是log输出
4.Serial3 是RC遥控命令输入输出
5.
//===================================================================
*/
//===================================================================
#include "Timer.h"//时间操作系统头文件 
Timer t;
float timeChange = 20; //滤波法采样时间间隔毫秒
int loopMS = 50;//50ms小车控制间隔
//===================================================================
//===================================================================
void setup() {
  //------------------------------------------------
  log_setup(); rc_setup(); delay(500);
  //------------------------------------------------
  Car_Init();Car_Speed_Start(loopMS,20);
  //------------------------------------------------
  PID_Init();Car_Pid_Test(0.6,20);
  //------------------------------------------------
  MPU6050_setup();
  int tickEvent1 = t.every(timeChange, MPU6050_loop);
  int tickEvent5 = t.every(loopMS, Car_loop);
  //------------------------------------------------
  //int tickEvent2 = t.every(50, MPU6050_show);
  //int tickEvent9 = t.every(500, rc_info_send);
  //------------------------------------------------
}
void loop() {
  //---------------------------------
  t.update();
  //lgFeed();rcFeed();
  //---------------------------------
  //Car_Pid_Loop();
  //Car_loop();//自带50ms延时
  //car_info_log();
  //---------------------------------
  //rc_pid_loop();
  //smartDelay(10);
  //---------------------------------
}
//static void smartDelay(unsigned long ms)
//{
//  unsigned long start = millis(); do {
//    //------------------------------------------
//    lgFeed();
//    rcFeed();
//    //------------------------------------------
//  } while (millis() - start < ms);
//}

